# 2. Дан список чисел. Создать список в который попадают числа, 
# описывающие возрастающую последовательность и содержащие максимальное 
# количество элементов. 
# Пример: [1, 5, 2, 3, 4, 6, 1, 7] => [1, 2, 3, 4, 6, 7]
#  [5, 2, 3, 4, 6, 1, 7] => [2, 3, 4, 6, 7]
#  Порядок элементов менять нельзя

array = [1, 5, 2, 3, 4, 6, 1, 7]
sorted_arr = []

for i in array:
    for j in array:
        if i < 
        sorted_arr.append(a)
    print()

print(sorted_arr)
